#+title: Implementing Pokemon in Javascript

#+author: Terence Cadd

* test if javascript on

#+begin_src js :exports both
 console.log("hello world");
#+end_src

#+RESULTS:
: hello world
: undefined

** pokemon1 with quantity --

#+BEGIN_SRC js :exports results
  var pokemon1 = {
    name: "Eevee",
    type: "Normal",
    hitPoints: 55,
    moves: [{name: "headbutt", damage: 18, quantity: 5 } ,
            {name: "side tackle", damage: 18, quantity: 5 } , /* side tackle quantity is 5 */
            {name: "punch", damage: 18, quantity: 5 } 
           ]
  };
  pokemon1.moves[1].quantity --;  
  console.log(pokemon1);  
#+END_SRC

#+RESULTS:
#+begin_example
{
  name: 'Eevee',
  type: 'Normal',
  hitPoints: 55,
  moves: [
    { name: 'headbutt', damage: 18, quantity: 5 },
    { name: 'side tackle', damage: 18, quantity: 4 },
    { name: 'punch', damage: 18, quantity: 5 }
  ]
}
undefined
#+end_example

If we wish to have a memory of the game , for instance to replay the game forwards , backwards or jump to an arbitrary point in the game and continue from there, we need a different approach

we need a function that returns almost identical copy except the move 'side tackle' has a quantity one less than before.

** executeMove function

#+BEGIN_SRC 
  function executeMove(pokemon , moveName){
      var copiedObject = {};
      Object.keys(pokemon).forEach(function (key){
          copiedObject[key] = pokemon[key];
      });
      copiedObject.moves = pokemon.moves.map(function(move){
          if (move.name === moveName && move.quantity > 0){
              var newMove = {name : move.name , damage: move.damage , quantity: move.quantity - 1}
              return newMove;
              }
          else {
              return move;
              }
          });
      return copiedObject;
  }
#+END_SRC

using our new function we will execute the move 'side tackle' on pokemon1 and also change the name of pokemon1 first move from 'headbutt' to 'crash hat'

#+BEGIN_SRC 
  var pokemon2 = executeMove(pokemon1 , 'side tackle');
  pokemon1.moves[0].name = 'crash hat';
#+END_SRC

and here is the result from node

#+NAME: first-try
#+BEGIN_SRC js :exports results
  function executeMove(pokemon , moveName){
      var copiedObject = {};
      Object.keys(pokemon).forEach(function (key){
          copiedObject[key] = pokemon[key];
      });
      copiedObject.moves = pokemon.moves.map(function(move){
          if (move.name === moveName && move.quantity > 0){
              var newMove = {name : move.name , damage: move.damage , quantity: move.quantity - 1}
              return newMove;
              }
          else {
              return move;
              }
          });
      return copiedObject;
  }

  var pokemon1 = {
      name: 'Eevee',
      type: 'Normal',
      hitPoints: 55,
      moves: [{name: 'headbutt', damage: 18, quantity: 5 } ,
              {name: 'side tackle', damage: 18, quantity: 5 } ,
              {name: 'punch', damage: 18, quantity: 5 } 
             ]
  };

  var pokemon2 = executeMove(pokemon1 , 'side tackle');

  pokemon1.moves[0].name = 'crash hat';

  console.log(pokemon1);

  console.log(pokemon2);

#+END_SRC

#+RESULTS: first-try
#+begin_example
{
  name: 'Eevee',
  type: 'Normal',
  hitPoints: 55,
  moves: [
    { name: 'crash hat', damage: 18, quantity: 5 },
    { name: 'side tackle', damage: 18, quantity: 5 },  //original
    { name: 'punch', damage: 18, quantity: 5 }
  ]
}
{
  name: 'Eevee',
  type: 'Normal',
  hitPoints: 55,
  moves: [
    { name: 'crash hat', damage: 18, quantity: 5 },
    { name: 'side tackle', damage: 18, quantity: 4 },  //change
    { name: 'punch', damage: 18, quantity: 5 }
  ]
}
undefined
#+end_example

we can see that the executeMove function left original pokemon1 with a quantity of 5 in the 'side tackle' move , but created a 'side tackle' quantity of 4 in pokemon2 .  this is exactly what we wanted to happen.

notice now that the name of the 'headbutt' move has been changed in both pokemon1 and pokemon2.  pokemon1 has corrupted pokemon2.  the offending line was 

#+BEGIN_SRC javascript

  pokemon1.moves[0].name = 'crash hat';

#+END_SRC

this is because pokemon1 and pokemon2 share exact same data in memory.

this is equivalent of setf in common lisp , go into data structure and do an inplace mutate.

think nreverse or nconc of common lisp again.




